{
  "course": [
    {
      "id": "1",
      "title": "new courses",
      "image" : "https://admin.ducatindia.com/courseCategory/1712574304790New%20Logo.png",
      "overview": "Ducat is pleased to introduce its latest courses that are designed to provide you with the most sought-after skills! Whether you are a tech genius or a beginner, Ducat offers something for all levels. The new courses from Ducat offer a combination of theoretical understanding and hands-on experience to prepare you for the job market quickly. Keep an eye out for more information or visit Ducat's website to explore the complete selection of new courses and begin your learning journey today!"
    },
    {
      "id": "2",
      "title": "java",
      "image" : "https://admin.ducatindia.com/courseCategory/1707541291282Java.png",
      "overview": "Start a transformational journey into the world of programming with our Java Training Course at our esteemed IT Institute. Learn all the key concepts of Java programming language and grasp core concepts like object-oriented programming, data structures, algorithm design, and more. Gain hands-on experience in developing robust applications and implementing best coding practices under the guidance of seasoned industry experts. As a testament to our commitment to your success, we offer 100% placement assistance upon course completion, ensuring that you step into the professional realm with confidence and expertise."
    },
    {
      "id": "3",
      "title": ".Net",
      "image" : "https://admin.ducatindia.com/courseCategory/1707541353559.net.jpg",
      "overview": "In this .NET Training Course, you'll gain hands-on experience working with advanced tools and technologies that are in high demand across various industries. Through practical exercises and real-world examples, you'll learn how to build powerful web applications, develop scalable enterprise solutions, and enhance your employability in the competitive job market. Our experienced instructors will guide you through key topics such as C#, ASP.NET, MVC, Entity Framework, and more, equipping you with the skills needed to excel in today's digital world. What's more, upon successful completion of the course, you can be assured of 100% placement assistance from our dedicated career support team."
    },
    {
      "id": "4",
      "title": "python",
      "image" : "https://admin.ducatindia.com/courseCategory/1707541375830Python.png",
      "overview": "Get into the world of programming with our Python Training Course Our comprehensive course covers key topics such as data types, control structures, functions, object-oriented programming, and more. With hands-on projects and real-world applications, you will gain practical experience in developing Python-based solutions for diverse industry needs. By mastering this versatile language, you'll have the power to build scalable web applications, analyse complex data sets, automate repetitive tasks, and much more. We are committed to your success beyond the classroom. That's why we provide 100% placement assistance to help you secure rewarding positions in top organisations upon completion of the course."
    },
    {
      "id": "5",
      "title": "software testing",
      "image": "https://admin.ducatindia.com/courseCategory/1707542832115Software%20Testing%20Training%20in%20Delhi.png",
      "overview": "Our Software Testing Training Course is specially designed to equip you with the knowledge and skills needed to thrive in this dynamic field. Delve into key topics such as manual and automated testing, test planning and documentation, defect tracking, and quality assurance techniques. Throughout the course, you'll benefit from hands-on practical exercises that simulate real testing scenarios, allowing you to apply theoretical concepts in a pragmatic setting."
    },
    {
      "id": "6",
      "title": "Web Designing - Full Stack Development",
      "image": "https://admin.ducatindia.com/courseCategory/1707542871845Web%20Designing%20Training%20in%20Delhi.png",
      "overview": "Our expert trainers will guide you through key topics including HTML, CSS, JavaScript, React.js, Node.js, MongoDB, and more. You'll gain hands-on experience with industry-relevant projects while learning best practices in web designing and full stack development. By enrolling in our course, not only will you acquire a deep understanding of essential technologies and frameworks used in modern web development but also benefit from our 100% placement assistance."
    },
    {
      "id": "7",
      "title": "Programming Languages",
      "image": "https://admin.ducatindia.com/courseCategory/1707543128376coding-language.png",
      "overview": "Our Programming language curriculum covers key topics such as Python, Java, C++, and more, providing a solid foundation for mastering multiple programming languages. You’ll gain practical expertise in coding and problem-solving, enabling you to gain success in diverse industry. What’s more, we pride ourselves on offering 100% placement assistance, ensuring that your newfound knowledge is seamlessly integrated into a rewarding professional journey."
    },
    {
      "id": "8",
      "title": "cloud computing",
      "image": "https://admin.ducatindia.com/courseCategory/1707543266247Cloud%20Computing%20(2).png",
      "overview": "Gain an in-depth understanding of key concepts, tools, and platforms essential for growing in today's digital era. Learn to manage the power of cloud technology to drive innovation, scalability, and cost-effectiveness within organisations. Our industry-expert trainers will guide you through topics such as cloud architecture, deployment models, security best practices, and automation techniques.As part of our commitment to your success, we offer 100% placement assistance upon completion of the course"
    },
    {
      "id": "9",
      "title": "service now",
      "image": "https://admin.ducatindia.com/courseCategory/1709815547266Service%20Now.png",
      "overview": ""
    },
    {
      "id": "10",
      "title": "salesforce",
      "image": "https://admin.ducatindia.com/courseCategory/1709196025322Salesforce.png",
      "overview": ""
    },
    {
      "id": "11",
      "title": "CAD training",
      "image": "https://admin.ducatindia.com/courseCategory/1707543621279cad%20(1).png",
      "overview": "This CAD Training course offers training to gain skills and knowledge needed to excel in the field of computer-aided design. Our intensive training program covers key topics such as 2D drafting, 3D modelling, parametric design, rendering techniques, and more. With a focus on practical application and real-world projects, students gain hands-on experience that prepares them for success in the industry. Moreover, our commitment to providing 100% placement assistance ensures that students have the support they need to secure rewarding positions in leading companies."
    },
    {
      "id": "12",
      "title": "Mobile Application Development",
      "image": "https://admin.ducatindia.com/courseCategory/1707543605920mobile%20app%20development.png",
      "overview": "This course is designed to equip you with the skills and knowledge such as iOS and Android development, user interface design, database integration, and more. With our 100% placement assistance during the Mobile Application Development course, you will gain hands-on experience with cutting-edge tools and technologies, allowing you to create sleek and innovative mobile applications from scratch. Through in-depth lectures and practical exercises, you will master essential concepts such as responsive design principles, API integration techniques, performance optimization strategies, and security best practices."
    },
    {
      "id": "13",
      "title": "Network & Security",
      "image": "https://admin.ducatindia.com/courseCategory/1707543758563Network%20&%20Security.jpg",
      "overview": "This Network & Security course provides the training for r the latest tools and techniques used to safeguard networks and data, ensuring you stay ahead in the ever-evolving digital landscape. Learn from industry experts as you delve into key topics such as network security principles, ethical hacking, cryptography, firewall management, and incident response. With a strong emphasis on hands-on practical learning and real-world simulations, you'll be equipped to tackle security challenges with confidence after completing this course."
    },
    {
      "id": "14",
      "title": "digital marketing",
      "image": "https://admin.ducatindia.com/courseCategory/1707543774278Digital%20Marketing.png",
      "overview": "Learn the power of online strategies to elevate business success and impact. By learning key topics such as social media marketing, search engine optimization, content creation, analytics, and more. Our comprehensive digital marketing course ensures learning on how to create compelling content that resonates with your target audience while maximising ROI through strategic ad campaigns. Gain insights into consumer behaviour and leverage data analytics tools to optimise your digital initiatives for maximum impact."
    },
    {
      "id": "15",
      "title": "MIS - Advanced Excel - BI Tools",
      "image": "https://admin.ducatindia.com/courseCategory/1707543835246png-transparent-microsoft-excel-logo-microsoft-word-microsoft-office-365-pivot-table-excel-office-xlsx-icon-microsoft-excel-logo-miscellaneous-template-angle-thumbnail.png",
      "overview": "Learn the power of data analysis and visualisation with our MIS Advanced Excel BI Tools course. Get the knowledge of the world of business intelligence and learn how to leverage advanced Excel tools to derive actionable insights from raw data. From creating interactive dashboards to performing complex data modelling, this course equips you with the skills needed to excel in today's competitive IT industry. You'll also master powerful BI tools like Power BI and Tableau, gaining expertise in transforming data into compelling visual stories for effective decision-making."
    },
    {
      "id": "16",
      "title": "Multimedia Animation - Graphics",
      "image": "https://admin.ducatindia.com/courseCategory/1707543978766multimedia%20Animation.png",
      "overview": "Step into the dynamic world of digital creativity with our Multimedia Animation and Graphics course and learn to bring your imagination to life through advanced animation software and design techniques. Get into the world of 2D and 3D animation, graphic design, visual effects, and interactive media production. Our expert trainers will guide you through key topics such as character animation, motion graphics, digital modelling, rendering techniques, and more.From mastering industry-standard software like Adobe Creative Suite and Autodesk Maya to learning about storyboard creation and compositing principle"
    },
    {
      "id": "17",
      "title": "ERP",
      "image": "https://admin.ducatindia.com/courseCategory/1707544070257SAP%20ERP%20Training%20in%20Delhi.png",
      "overview": "In this ERP course you will gain in-depth knowledge and hands-on experience in Enterprise Resource Planning (ERP) systems, equipping you with the skills to streamline business processes and drive organisational success .Learn key topics such as ERP modules, implementation methodologies, data management, and business process re-engineering. Experience real-world simulations and case studies that will immerse you in practical scenarios, preparing you for the dynamic demands of today's industry."
    },
    {
      "id": "18",
      "title": "Industrial Training",
      "image": "https://admin.ducatindia.com/courseCategory/1707544144356Industrial%20Training.png",
      "overview": "In this Industrial Training course you will learn topics such as machine learning, cybersecurity, cloud computing, and data analytics. With hands-on training and expert guidance, you'll gain practical experience that sets you apart in a competitive job market. Through personalised mentorship and interactive workshops, you will develop the proficiency to tackle complex IT challenges with confidence. Join our Industrial Training course today and unlock limitless opportunities for professional growth. With a curriculum designed by industry experts and continuous updates based on market trends, we guarantee that your skillset will remain relevant throughout your career journey."
    },
    {
      "id": "19",
      "title": "Microsoft Dynamic",
      "image": "https://admin.ducatindia.com/courseCategory/1707544261743Microsoft%20Dynamic.jpg",
      "overview": "Our Microsoft Dynamics course program is designed to provide students with a deep understanding of the Microsoft Dynamics platform, empowering them with the skills and knowledge needed to excel in this dynamic field. Through hands-on training and expert instruction, students will delve into key topics such as CRM fundamentals, customization and configuration, integration with other Microsoft tools, and more."
    },
    {
      "id": "20",
      "title": "others",
      "image": "https://admin.ducatindia.com/courseCategory/1707544332728Other.png",
      "overview": "Learn the other in-demand course, designed to equip you with an invaluable set of skills that are highly coveted by top employers globally. Learn into comprehensive modules covering essential topics such as software development methodologies, database management systems, network infrastructure design, artificial intelligence applications, and much more. Moreover, our commitment to providing 100% placement assistance means that you can confidently pursue new professional opportunities immediately after finishing the program."
    }
  ]
}
